[M_Sage_BorokCage MissionDefinition]
MissionDescription="An auteur documentarian named Dietmar Von Heinrichzimmerschneit has made you the subject of his documentary. He wants you to go find a creature he has named ''Der Monstrositat'' and capture it in a cage."
TurnInDescription="''Von Henrichzimmerschneit'' isn't actually the name he was born with. His real name has so many syllables that you would starve to death by the time you finished saying it."
TeaserText="Art requires suffering... but not yours."
